<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"68281a6797f90dbed0d347abb17989f80978e7f7dbcff960d51ab2937d05420d","plan_job_ref":"Job Plan Airflow DAGs #176 at https://github.com/cal-itp/data-infra/actions/runs/16062597099","plan_out_hash":"28484eed587c7a5b9e45f4162dd8fd2c626697708ce5abd84a9b977d69e0634f","plan_hash":"2e7dfafc96300fc69fd08b6771900005019880632ad7e36955fb960a00ee7565","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "xETyWg==" -> (known after apply)
!~      detect_md5hash      = "Zj8YHXGg6ToATWmhB5GOFw==" -> "different hash"
!~      generation          = 1749661097876415 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
!~      md5hash             = "Zj8YHXGg6ToATWmhB5GOFw==" -> (known after apply)
        name                = "dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "3dzBQQ==" -> (known after apply)
!~      detect_md5hash      = "OnngZ3J4ZgG75SNNK24/8A==" -> "different hash"
!~      generation          = 1749663117168171 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "OnngZ3J4ZgG75SNNK24/8A==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/payments/indexes/payments_tests_daily_date_spine.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "kWcgvw==" -> (known after apply)
!~      detect_md5hash      = "tuAbU49L9JQU2UGKkY3YsQ==" -> "different hash"
!~      generation          = 1749663117050978 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/payments/indexes/payments_tests_daily_date_spine.sql"
!~      md5hash             = "tuAbU49L9JQU2UGKkY3YsQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/indexes/payments_tests_daily_date_spine.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (21 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #176](https://github.com/cal-itp/data-infra/actions/runs/16062597099)